# Work with paths

    
    
      
    

    
      
      Stay organized with collections
    
    
      
      Save and categorize content based on your preferences.

Skip to main content

 ![Google Cloud Documentation](https://www.gstatic.com/devrel-devsite/prod/vab7d3990237361b4739a5005ec80b0af3ee973650a028ed684c6b12bd1dc988a/clouddocs/images/lockup_full_color.svg)

Technology areas

close

*   AI and ML
    
*   Application development
    
*   Application hosting
    
*   Compute
    
*   Data analytics and pipelines
    
*   Databases
    
*   Distributed, hybrid, and multicloud
    
*   Industry solutions
    
*   Migration
    
*   Networking
    
*   Observability and monitoring
    
*   Security
    
*   Storage
    

Cross-product tools

close

*   Access and resources management
    
*   Costs and usage management
    
*   Infrastructure as code
    
*   SDK, languages, frameworks, and tools
    

/

Console

*   English
*   Deutsch
*   Español
*   Español – América Latina
*   Français
*   Indonesia
*   Italiano
*   Português
*   Português – Brasil
*   עברית
*   中文 – 简体
*   中文 – 繁體
*   日本語
*   한국어

Sign in

 ![](https://docs.cloud.google.com/_static/clouddocs/images/icons/products/spanner-color.svg)

*   Spanner

Start free

Overview Guides Reference Samples Support Resources ![Google Cloud Documentation](https://www.gstatic.com/devrel-devsite/prod/vab7d3990237361b4739a5005ec80b0af3ee973650a028ed684c6b12bd1dc988a/clouddocs/images/lockup_full_color.svg)

*   Technology areas
    
    *   More
    
    *   Overview
    *   Guides
    *   Reference
    *   Samples
    *   Support
    *   Resources
*   Cross-product tools
    *   More
*   Console

*   Discover
    
*   Product overview
*   Spanner editions overview
*   Security, privacy, risk, and compliance overview
*   PostgreSQL interface
*   Spanner for non-relational workloads
    
    *   Non-relational overview
    *   Cassandra interface
    
*   Get started
    
*   Spanner proof of concept playbook
*   Set up your environment
*   Create and query a database
    
    *   Use the Google Cloud console
    *   Use the gcloud CLI
    
*   Manage your data using the Google Cloud console
*   Client libraries
    
    *   C++ quickstart
    *   C# quickstart
    *   Go quickstart
    *   Java quickstart
    *   Node.js quickstart
    *   PHP quickstart
    *   Python quickstart
    *   Ruby quickstart
    *   REST quickstart
    
*   Drivers
    
    *   Set up with drivers
    *   JDBC quickstart
    *   Go database/sql quickstart
    *   ADO.NET quickstart
    *   PostgreSQL drivers quickstart
    
*   Spanner CLI
    
    *   Spanner CLI quickstart
    *   Spanner CLI commands
    
*   Free trial instances
    
    *   Free trial instances overview
    *   Create a free trial instance
    
*   Data residency overview
*   Create and manage
    
*   Instances
    
    *   Instances overview
    *   Nodes and processing units
    *   Regional, dual-region, and multi-region configurations
    *   Region types
    *   Replication
    *   Geo-partition data
        
        *   Geo-partitioning overview
        *   Create and manage instance partitions
        *   Create and manage data placements
        *   Indexes and geo-partitioning
        
    *   Leader-aware routing
    *   Global and regional service endpoints
    *   Tiered storage
    *   Create and manage instances
    *   Create and manage instance configurations
    *   Change dual-region quorum
    *   Move an instance
    *   Autoscale instances
        
        *   Autoscaling overview
        *   Managed autoscaler
        *   Open source Autoscaler tool
            
            *   Autoscaler tool overview
            *   Deploy the Autoscaler tool to Cloud Run functions
            *   Deploy the Autoscaler tool to GKE
            
        
    *   Control access and organize instances using tags
    *   Organize instances and view costs using labels
    
*   Databases
    
    *   Databases overview
    *   Choose between GoogleSQL and PostgreSQL
    *   Create and manage databases
    *   Prevent accidental database deletion
    *   Schema object drop protection
    *   Modify the leader region of a database
    *   Set the default time zone for a database
    
*   Manage resources using Data Catalog
*   Design and manage a database schema
    
    *   Schemas overview
    *   Schema design best practices
    *   Make schema updates
    *   Schema update best practices
    *   Create and manage named schemas
    *   Views overview
    *   Create and manage views
    *   Secondary indexes
    *   Foreign keys
    *   Primary key default values management
    *   Create and manage foreign key relationships
    *   Create and manage check constraints
    *   Create and manage generated columns
    *   Store arbitrary precision numeric data
    *   Create and manage sequences
    *   Manage table names
    *   Create and manage locality groups
    
*   Routines
    
    *   Remote functions
    
*   Manage and observe long-running operations
*   Configure time to live (TTL)
    
    *   TTL overview
    *   Manage data retention with TTL
    *   TTL metrics and monitoring
    
*   Connect
    
*   Connect to a PostgreSQL-dialect database
*   Connect PostgreSQL clients to Spanner using PGAdapter
    
    *   PGAdapter overview
    *   Get PGAdapter
    *   Start PGAdapter
    *   PGAdapter session management commands
    *   Connect PGAdapter to the emulator
    
*   Connect to Spanner using the Cassandra Adapter
*   Create and connect a Compute Engine VM instance to access Spanner
*   Connect to Spanner with a GKE cluster
*   Connect to Spanner from other Google Cloud services
*   Authenticate to Spanner
*   Secure and control access
    
*   Access control with IAM
    
    *   IAM overview
    *   Apply IAM roles
    
*   Fine-grained access control
    
    *   Fine-grained access control overview
    *   Fine-grained access control for change streams
    *   Fine-grained access control for sequences
    *   Fine-grained access control for models
    *   Configure fine-grained access control
    *   Access a database with fine-grained access control
    *   Fine-grained access control privileges
    *   Fine-grained access control system roles
    
*   Add a custom organization policy
*   Data encryption
    
    *   Customer-managed encryption keys (CMEK)
        
        *   CMEK overview
        *   Secure a database using CMEK
        
    *   Data encryption in transit
    
*   Migrate
    
*   Migration process
    
    *   Migration overview
    *   Assess your migration
    *   Migrate your schema
    *   Migrate your application
    *   Optimize your schema and application performance
    *   Migrate your data
    *   Validate your data
    *   Configure cutover and fallback mechanisms
    
*   Migration tools
    
    *   Migration tools overview
    *   Set up Spanner migration tool (SMT)
    
*   Primary key migration
    
    *   Primary key migration overview
    *   Migrate primary keys
    
*   Migrate from MySQL
    
    *   MySQL migration overview
    *   MySQL schema migration
        
        *   Migrate schema from MySQL overview
        *   Use SMT to migrate schema from MySQL
        
    *   Migrate your MySQL data
    *   Configure fallback for MySQL
    
*   Load sample data
*   Migrate from DynamoDB
*   Migrate from Oracle
*   Migrate from PostgreSQL
    
    *   Migrate to a GoogleSQL-dialect database
    *   Migrate to a PostgreSQL-dialect database
    
*   Migrate from Cassandra
*   Migrate Spanner to a PostgreSQL database
*   Import and export data
    
*   Import and export overview
*   Import, export, and modify data using Dataflow
*   Import and export data in Avro format
    
    *   Import Spanner Avro files
    *   Export data from Spanner to Avro
    *   Import data from non-Spanner databases
    
*   Import and export data in CSV format
*   Import a database from Cloud SQL
*   Import data from PostgreSQL using COPY
*   Bulk loading best practices
*   Disaster recovery
    
*   Disaster recovery overview
*   Back up databases
    
    *   Backups overview
    *   Create backups
    *   Create and manage backup schedules
    *   Manage backups
    
*   Restore databases
    
    *   Restore overview
    *   Restore from a backup
    
*   Point-in-time recovery (PITR)
    
    *   PITR overview
    *   Recover data using PITR
    
*   Develop
    
*   Write SQL with Gemini assistance
*   Use case best practices
    
    *   Spanner as a gaming database
    
*   Integrate language frameworks
    
    *   Spanner with Hibernate
        
        *   Integrate with Hibernate ORM (GoogleSQL)
        *   Integrate with Hibernate ORM (PostgreSQL)
        *   Write a Hibernate app that connects to Spanner
        
    *   Spanner with Spring Data JPA
        
        *   Integrate with Spring Data JPA (GoogleSQL)
        *   Integrate with Spring Data JPA (PostgreSQL)
        
    *   Spanner with Spring Data JDBC
        
        *   Integrate with Spring Data JDBC (GoogleSQL)
        *   Integrate with Spring Data JDBC (PostgreSQL)
        
    *   Spanner with MyBatis
        
        *   Integrate with MyBatis and Spring Boot (GoogleSQL)
        *   Integrate with MyBatis and Spring Boot (PostgreSQL)
        
    *   Spanner with Spring Data
    *   Write a Spring Boot app that connects to Spanner
    *   Spanner with GORM
        
        *   Integrate with GORM (GoogleSQL)
        *   Integrate with GORM (PostgreSQL)
        
    *   Spanner with Django ORM
    *   Spanner with SQLAlchemy
        
        *   Integrate with SQLAlchemy (GoogleSQL)
        *   Integrate with SQLAlchemy (PostgreSQL)
        
    *   Spanner with Active Record
    *   Spanner with Entity Framework Core
    
*   Use transactions
    
    *   Transactions overview
    *   Timestamp bounds
    *   Commit timestamps
        
        *   In GoogleSQL-dialect databases
        *   In PostgreSQL-dialect databases
        
    *   TrueTime and external consistency
    *   Isolation levels
        
        *   Isolation levels overview
        *   Use repeatable read isolation
        *   Use SELECT FOR UPDATE in serializable isolation
        *   Use SELECT FOR UPDATE in repeatable read isolation
        
    *   Concurrency control
    *   Throughput optimized writes
    *   Retrieve commit statistics for a transaction
    
*   Sessions
*   SQL best practices
*   Read data
    
    *   Reads outside of transactions
    *   Directed reads
    *   Read lease
    *   Use Data Boost independent compute resources for reads
        
        *   Data Boost overview
        *   Run federated queries with Data Boost
        *   Export data with Data Boost
        *   Use Data Boost in your applications
        *   Monitor Data Boost usage
        *   Monitor and manage Data Boost quota usage
        
    *   Use saved queries
        
        *   Saved queries overview
        *   Create and manage saved queries
        
    
*   Modify data
    
    *   Modify data using the Google Cloud console
    *   Modify data using the gcloud CLI
    *   Modify data using DML
        
        *   Insert, update, and delete data using DML
        *   Partitioned DML
        *   DML best practices
        
    *   Modify data using mutations
    *   Compare DML with mutations
    *   Modify data using batch write
    
*   Work with data types
    
    *   Work with arrays
        
        *   In GoogleSQL-dialect databases
        *   In PostgreSQL-dialect databases
        
    *   Work with STRUCT objects
    *   Work with NUMERIC data
    *   Work with JSON data
    *   Work with JSONB data
    *   Work with protocol buffers in GoogleSQL
    
*   Develop and test
    
    *   Emulate Spanner locally
    *   Use Terraform with Spanner
    *   Configure custom timeouts and retries
    *   Configure statement timeout
    *   Configure transaction timeout
    
*   Process and view data
    
    *   Dataflow templates
    *   Stream out data changes
        
        *   Change streams overview
        *   Create and manage change streams
        *   Build change streams connections using Dataflow
        *   Build change streams connections to Kafka
        *   Change streams partitions, records, and queries
        
    *   Integrate Spanner with IntelliJ
    *   Integrate Spanner with Looker
    *   Integrate Spanner with Liquibase
    
*   Full-text search
    
    *   Full-text search overview
    *   Tokenization and Search Indexes
        
        *   Tokenization
        *   Search indexes
        *   Numeric search indexes
        *   JSON search indexes
        *   Partition search indexes
        *   Combine TOKENLISTs
        
    *   Full-text search queries
        
        *   Query overview
        *   Search multiple columns
        *   Mix full-text and non-text queries
        *   Rank search results
        *   Perform a substring search
        *   Search with query enhancement
        *   Accelerate pattern-matching functions
        *   Find approximate matches with fuzzy search
        *   Perform top-k pattern matching
        *   Perform a search using facets
        *   Paginate search results
        
    *   Hybrid full-text and vector search patterns
    *   Search versus secondary indexes
    
*   Install MySQL functions in Spanner
*   Implement multi-tenancy in Spanner
*   Build data agents with conversational analytics
*   Query database in natural language with QueryData
    
    *   Use context sets
        
        *   Context sets overview
        *   Build context sets using Gemini CLI
        *   Manage context sets in Spanner Studio
        
    *   Query your agentic application data
        
        *   QueryData overview
        *   Test QueryData in Spanner Studio
        *   Integrate QueryData with an application
        
    
*   Spanner AI and machine learning
    
*   Spanner AI overview
*   Get started using Spanner for generative AI applications
*   Spanner integration with Agent Platform
*   Vector search
    
    *   Vector search overview
    *   Generate embeddings
        
        *   Get Agent Platform text embeddings
        *   Generate vector embeddings in bulk using partitioned DML
        
    *   Perform K-nearest neighbors search
    *   Choose the best vector distance function
    *   Approximate nearest neighbors (ANN)
        
        *   Perform ANN search with vector indexes
        *   Create and manage vector indexes
        *   Vector indexing best practices
        
    *   Export embeddings to Agent Platform Vector Search
    *   Vector search best practices
    *   Troubleshoot vector search
    
*   Generate predictions
    
    *   Generate ML predictions using SQL
    *   Use Generative AI with a sample ecommerce application
    *   Generate ML predictions using the Spanner emulator
    
*   Integrate with AI technologies
    
    *   Build LLM-powered applications using LangChain
    *   Use Spanner with agents
    *   Best practices for securing agent interactions with MCP
    *   Build applications using LlamaIndex
    *   Use the Spanner remote MCP server
    
*   Spanner Graph
    
*   Product overview
*   Set up and query Spanner Graph
*   Spanner Graph schema
    
    *   Schema overview
    *   Create and manage a Spanner Graph schema with DDL
    *   Create and manage a Spanner Graph schema visually
    *   Best practices for designing a schema
    *   Use SQL views to create a property graph
        
        *   Overview of graphs created from SQL views
        *   Create a graph from SQL views
        
    
*   Manage Spanner Graph data
*   Spanner Graph queries
    
    *   Queries overview
    *   Work with paths
    *   Best practices for tuning queries
    *   Use full-text search with Spanner Graph
    *   Use vector search with Spanner Graph
    
*   Spanner Graph algorithms
    
    *   Graph algorithms overview
    *   Run algorithms
    *   Algorithm schema requirements and feature compatibility
    *   Algorithms catalog
    *   Best practices for running algorithms on Spanner Graph
    
*   Spanner Graph visualizations
    
    *   Use Spanner Graph visualizations
    *   Work with Spanner Graph visualization integrations
    
*   Manage schemaless data with Spanner Graph
*   Load BigQuery data into Spanner Graph
*   Migrate to Spanner Graph
*   Spanner Graph reference for openCypher users
*   Troubleshoot Spanner Graph
*   Monitor
    
*   Capture telemetry signals
    
    *   Signal capture overview
    *   Trace collection
        
        *   Trace collection overview
        *   Set up trace collection using OpenTelemetry
        
    *   Monitor Spanner using the Database insights MCP server
    *   Metrics
        
        *   Metrics list
        *   Client-side metric collection
            
            *   View and manage client-side metrics
            *   Client-side metrics description
            
        *   Custom client-side metric collection
            
            *   Capture custom client-side metrics using OpenTelemetry
            *   Capture custom client-side metrics using OpenCensus
            
        
    *   Audit logs
    
*   Monitor instances
    
    *   Monitor instance performance using insights
    *   Monitor instances using Cloud Monitoring
    
*   Optimize and troubleshoot
    
*   Optimize Spanner performance
    
    *   Performance overview
    *   Analyze query performance
    *   Monitor active queries
    *   Query optimizer
        
        *   Query optimizer overview
        *   Query optimizer versions
        *   List query optimizer versions
        *   Manage the query optimizer
        
    *   Query execution plans
    *   Tune a query using the query plan visualizer
    *   Accelerate analytical queries using the columnar engine
        
        *   Spanner columnar engine overview
        *   Configure Spanner columnar engine
        *   Query columnar data
        *   Monitor columnar engine
        
    *   Find hotspots in your database
    *   Use the index advisor
    
*   Manage split points for anticipated traffic increase
    
    *   Pre-splitting overview
    *   Create and manage split points
    
*   Manually trigger major compaction in a Spanner database
*   Analyze usage patterns with Key Visualizer
    
    *   Key Visualizer overview
    *   Access Key Visualizer
    *   Explore Key Visualizer heatmaps
    *   Key Visualizer heatmap patterns
    
*   Troubleshoot latency
    
    *   Latency points in a Spanner request
    *   Identify where latency occurs
    *   Use metrics to diagnose latency
    *   Calculate streaming and partition request latency
    *   Identify transactions that cause high latencies
    
*   Troubleshoot issues using built-in statistics tables
    
    *   Built-in statistics tables overview
    *   Active partitioned DMLs statistics
    *   Columns operations statistics
    *   Lock statistics
    *   Oldest active queries statistics
    *   Query statistics
    *   Read statistics
    *   Split statistics
    *   Table operations statistics
    *   Table sizes statistics
    *   Transaction statistics
    *   Vector index statistics
    
*   Troubleshoot instance utilization
    
    *   CPU utilization overview
    *   Troubleshoot high CPU utilization
    *   Storage utilization
    
*   Troubleshoot performance regressions
*   Monitor and troubleshoot with Gemini assistance
*   Troubleshoot CMEK org policy violations
*   Troubleshoot with request tags and transaction tags
*   Troubleshoot deadline exceeded errors
*   Troubleshoot Agent Platform integration errors
*   Error codes

*   AI and ML
*   Application development
*   Application hosting
*   Compute
*   Data analytics and pipelines
*   Databases
*   Distributed, hybrid, and multicloud
*   Industry solutions
*   Migration
*   Networking
*   Observability and monitoring
*   Security
*   Storage

*   Access and resources management
*   Costs and usage management
*   Infrastructure as code
*   SDK, languages, frameworks, and tools

*   Home
*   Documentation
*   Databases
*   Spanner
*   Guides

Send feedback

# Work with paths Stay organized with collections Save and categorize content based on your preferences.

**Note:** This feature is available with the Spanner Enterprise edition and Enterprise Plus edition. For more information, see the Spanner editions overview.

This page describes how to work with graph paths in Spanner Graph.

In graph databases, the graph path data type represents a sequence of nodes interleaved with edges and shows how these nodes and edges are related. To learn more about the path data type, see Graph path type.

With the Spanner Graph Language (GQL), you can construct graph paths and perform queries on them. The examples in this document use the same Spanner Graph schema as found on the Set up and query Spanner Graph page.

## Construct a graph path

You can construct a graph path by creating a path variable in a graph pattern or with the `PATH` function.

We recommend constructing a graph path by using the path variable. The format to create a path variable is:

```
MATCH p = PATH_PATTERN
```

For more information, see Graph pattern.

#### Example

In the following example, the query finds patterns of money transfers between accounts within `FinGraph`.

```
GRAPH FinGraph
MATCH p = (src:Account {id: 16})-[t:Transfers]->{2}(dst:Account {id: 7})
RETURN TO_JSON(p) AS full_path;
```

#### Result

full_path

[{"identifier": ..., "properties": {"id": 16, ...}, ...}, {"identifier": ..., "properties": {"amount": 300.0, ...}, ...}, ...]

The result indicates that the query found the `Account -> Transfers -> Account` pattern in the database.

## Query a graph path

You can use the following path-specific functions to query a graph path. For more general information about Spanner Graph queries, see Queries overview.

### EDGES

The `EDGES` function returns all the edges in a graph path. For detailed semantics, see `EDGES`.

#### Example

This query finds a path between two accounts that pass through a middle account. It returns the amount of the second `Transfers` edge in the path which might be between `src` and `mid` or between `mid` and `dst`.

```
GRAPH FinGraph
MATCH p = (src:Account {id: 7})-[t1:Transfers]->{1,3}(mid:Account)-[t2:Transfers]->
  {1,3}(dst:Account {id: 16})
LET second_edge = EDGES(p)[1]
RETURN DISTINCT src.id AS src, dst.id AS dst, second_edge.amount AS second_edge_amount;
```

#### Result

src

dst

second_edge_amount

7

16

300

### NODES

The `NODES` function returns all the nodes in a graph path. For detailed semantics, see `NODES`.

#### Example

This query finds the graph path of two transfers, and then returns a JSON list representing the path.

```
GRAPH FinGraph
MATCH p = (src:Account)-[t:Transfers]->{2}(dst:Account)
RETURN TO_JSON(NODES(p)) AS nodes;
```

#### Result

nodes

[{"identifier": "...", "properties": {"id": 16}, ...}, {"identifier": "...", "properties": {"id": 20, ...}, ...]

...

### PATH_FIRST

The `PATH_FIRST` function finds the first node in a graph path. For detailed semantics, see `PATH_FIRST`.

#### Example

This query finds the first node in a graph path of two transfers. It returns the label of the `Account` node and the account's nickname.

```
GRAPH FinGraph
MATCH p = -[:Transfers]->{1,3}(dst:Account{id: 7})
RETURN DISTINCT PATH_FIRST(p).id AS can_reach_target;
```

#### Result

can_reach_target

7

16

20

### PATH_LAST

The `PATH_LAST` function finds the last node in a graph path. For detailed semantics, see `PATH_LAST`.

#### Example

This query finds the last node in a graph path of two transfers. It returns the label of the `Account` node and the account's nickname.

```
GRAPH FinGraph
MATCH p =(start:Account{id: 7})-[:Transfers]->{1,3}
RETURN DISTINCT PATH_LAST(p).id as can_reach_target;
```

#### Result

can_reach_target

7

16

20

### PATH_LENGTH

The `PATH_LENGTH` function finds the number of edges in a graph path. For detailed semantics, see `PATH_LENGTH`.

#### Example

This query finds the number of edges in a graph path that contains one to three transfers.

```
GRAPH FinGraph
MATCH p = (src:Account)-[e:Transfers]->{1,3}(dst:Account)
RETURN PATH_LENGTH(p) AS num_transfers, COUNT(*) AS num_paths;
```

#### Result

num_transfers

num_paths

1

5

2

7

3

11

### IS_ACYCLIC

The `IS_ACYCLIC` function checks if a graph path has repeating nodes. It returns `TRUE` if repetition is found, otherwise it returns `FALSE`. For detailed semantics, see `IS_ACYCLIC`.

#### Example

This query checks if this graph path has repeating nodes.

```
GRAPH FinGraph
MATCH p = (src:Account)-[t:Transfers]->{2}(dst:Account)
RETURN IS_ACYCLIC(p) AS is_acyclic_path,
       ARRAY_TRANSFORM(NODES(p), n->n.id) AS account_ids;
```

#### Result

is_acyclic_path

account_ids

TRUE

16,20,7

TRUE

20,7,16

TRUE

20,7,16

FALSE

16,20,16

TRUE

7,16,20

TRUE

7,16,20

FALSE

20,16,20

### IS_TRAIL

The `IS_TRAIL` function checks if a graph path has repeating edges. It returns `TRUE` if repetition is found, otherwise it returns `FALSE`. For detailed semantics, see `IS_TRAIL`.

#### Example

This query checks if this graph path has repeating edges.

```
GRAPH FinGraph
MATCH p = (src:Account)-[t:Transfers]->{3}(dst:Account)
WHERE src.id < dst.id
RETURN IS_TRAIL(p) AS is_trail_path,
       ARRAY_TRANSFORM(t, t->t.id) AS transfer_ids
```

#### Result

is_trail_path

transfer_ids

FALSE

16,20,16

TRUE

7,16,20

TRUE

7,16,20

## Path modes

In Spanner Graph, the default behavior is to return all paths, including paths with repeating nodes and edges. You can use the following path modes to include or exclude paths that have repeating nodes and edges. For detailed semantics, see the Path mode documentation.

### WALK

The `WALK` path mode returns all paths, including paths with repeating nodes and edges. `WALK` is the default path mode.

#### Example

The following query demonstrates the use of the `WALK` path mode on a quantified path pattern. The first path in the results have repeated edges.

```
GRAPH FinGraph
MATCH p = WALK (src:Account)-[t:Transfers]->{3}(dst:Account)
WHERE src.id < dst.id
RETURN ARRAY_TRANSFORM(t, t->t.id) AS transfer_ids
```

#### Result

transfer_ids

16,20,16

7,16,20

7,16,20

### ACYCLIC

The `ACYCLIC` path mode filters out paths that have repeating nodes.

#### Example

The following query demonstrates the use of the `ACYCLIC` path mode on a quantified path pattern. The path with equal `src` and `dst` nodes is filtered out.

```
GRAPH FinGraph
MATCH p = ACYCLIC (src:Account)-[t:Transfers]->{2}(dst:Account)
RETURN ARRAY_TRANSFORM(NODES(p), n->n.id) AS account_ids
```

#### Result

account_ids

16,20,7

20,7,16

20,7,16

7,16,20

7,16,20

### TRAIL

The `TRAIL` path mode filters out paths that have repeating edges.

#### Example

The following query demonstrates the use of the `TRAIL` path mode on a quantified path pattern. Paths with repeated edges are filtered out.

```
GRAPH FinGraph
MATCH p = TRAIL (src:Account)-[t:Transfers]->{3}(dst:Account)
WHERE src.id < dst.id
RETURN ARRAY_TRANSFORM(t, t->t.id) AS transfer_ids
```

#### Result

transfer_ids

7,16,20

7,16,20

## Path search prefix

You can use a path search prefix to restrict a path pattern to return the shortest path from each data partition. For detailed semantics, see Path search prefix.

### ANY SHORTEST

The `ANY SHORTEST` path search prefix returns the shortest path (the path with the least number of edges) that matches the pattern from each data partition. If there are more than one shortest paths per partition, returns any one of them.

#### Example

The following query matches any path between each pair of `[a, b]`.

```
GRAPH FinGraph
MATCH p = ANY SHORTEST (a:Account {is_blocked:true})-[t:Transfers]->{1,4}(b:Account)
LET total_amount = SUM(t.amount)
RETURN a.id AS account1_id, total_amount, b.id AS account2_id;
```

#### Result

account1_id

total_amount

account2_id

16

500

16

16

800

7

16

300

20

### ANY CHEAPEST

The `ANY CHEAPEST` path search prefix ensures that for each pair of source and destination accounts, the query returns only one path with the minimum total compute cost. A cheapest path is one with the minimum total compute cost, calculated from `COST` expressions on edges in the path. If multiple cheapest paths exist per partition, the query returns any one of them.

#### Example

The following query matches one of the cheapest paths between each pair of accounts, represented by `a` and `b`, based on transfer amount.

```
GRAPH FinGraph
MATCH ANY CHEAPEST (a:Account)-[t:Transfers COST t.amount]->{1,3}(b:Account)
LET total_cost = sum(t.amount)
RETURN a.id AS account1_id, b.id AS account2_id, total_cost
```

#### Result

account1_id

account2_id

total_cost

7

7

900

7

16

100

7

20

400

16

7

800

16

16

500

16

20

300

20

7

500

20

16

200

20

20

500

## Conversion rules

For more information, see GRAPH_PATH conversion rules.

## Use case example

In the following use case example, you find all accounts have been routed through one to three accounts, from account ID `20`.

```
GRAPH FinGraph
MATCH p = (start:Account {id: 20})-[:Transfers]->{1,3}(dst:Account)
RETURN DISTINCT dst.id AS dst;
```

**Result**

dst

7

16

20

However, a query that returns to account ID `20` might be an overly broad query because it starts with account ID `20`. To show more specific results, you can enforce your query to show only acyclic graph paths without any repeating nodes. To do so, you can:

*   Use `MATCH p = ACYCLIC <path_pattern>`; or
*   Apply an `IS_ACYCLIC(p)` filter in your query

The following query uses `MATCH p = ACYCLIC PATH_PATTERN`:

```
GRAPH FinGraph
MATCH p = ACYCLIC (start:Account {id: 20})-[:Transfers]->{1,3}(dst:Account)
RETURN DISTINCT dst.id AS dst;
```

**Result**

dst

7

16

If you want to know the first account that money is transferred through, then you can run the following query:

```
GRAPH FinGraph
MATCH p = ACYCLIC (start:Account {id: 20})(-[:Transfers]->
  (nexts:Account)){1,3}(dst:Account)
RETURN dst.id AS dst, ARRAY_AGG(DISTINCT nexts[0].id) AS unique_starts;
```

This query is unconventional because it introduces a new variable inside the quantified path using `nexts` to get the result. With path variables, you can simplify the query:

```
GRAPH FinGraph
MATCH p = ACYCLIC (start:Account {id: 20})-[:Transfers]->{1,3}(dst:Account)
RETURN dst.id AS dst, ARRAY_AGG(DISTINCT NODES(p)[OFFSET(1)].id) AS unique_starts;
```

Using `NODES(p)` returns all nodes along the path. Because the first node account is specified as `start`, the next one (at the first offset) is the first account that money is transferred through.

**Result**

dst

unique_starts

7

16, 7

Paths are more useful when there are multiple quantified paths. You can add a constraint that the paths found from `start` must pass through account ID `7`:

```
GRAPH FinGraph
MATCH p = ACYCLIC (start:Account {id: 20})-[:Transfers]->
  {1,3}(mid:Account {id: 7})-[:Transfers]->{1,3}(dst:Account)
RETURN dst.id AS dst,
  ARRAY_AGG(DISTINCT NODES(p)[OFFSET(1)].id) AS unique_starts;
```

Although the `MATCH` statement changed, the rest of the query doesn't need to change. Without using path variables, there are cases where it's not possible for Spanner to statically know which quantified path to inspect.

Using a path variable, you can get the sum of all transfers:

```
GRAPH FinGraph
MATCH p = ACYCLIC (start:Account {id: 20})-[:Transfers]->
  {1,3}(mid:Account {id: 7})-[:Transfers]->{1,3}(dst:Account)
LET all_transfers = EDGES(p)
LET transfer_amounts = SUM(all_transfers.amount)
RETURN dst.id AS dst,
  ARRAY_AGG(DISTINCT NODES(p)[OFFSET(1)].id) AS participating_neighbor_nodes, transfer_amounts;
```

**Result**

dst

participating_neighbor_nodes

transfer_amounts

16

7

600

16

7

800

## What's next

*   Graph path type
*   `PATH` function
*   Path mode
*   Path search prefix

Send feedback

Except as otherwise noted, the content of this page is licensed under the Creative Commons Attribution 4.0 License, and code samples are licensed under the Apache 2.0 License. For details, see the Google Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates.

Last updated 2026-06-09 UTC.

*   ### Products and pricing
    
    *   See all products
    *   Google Cloud pricing
    *   Google Cloud Marketplace
    *   Contact sales
*   ### Support
    
    *   Community forums
    *   Support
    *   Release Notes
    *   System status
*   ### Resources
    
    *   GitHub
    *   Getting Started with Google Cloud
    *   Code samples
    *   Cloud Architecture Center
    *   Training and Certification
*   ### Engage
    
    *   Blog
    *   Events
    *   X (Twitter)
    *   Google Cloud on YouTube
    *   Google Cloud Tech on YouTube

*   About Google
*   Privacy
*   Site terms
*   Google Cloud terms
*   Manage cookies
*   Our third decade of climate action: join us
*   Sign up for the Google Cloud newsletter Subscribe

*   English
*   Deutsch
*   Español
*   Español – América Latina
*   Français
*   Indonesia
*   Italiano
*   Português
*   Português – Brasil
*   עברית
*   中文 – 简体
*   中文 – 繁體
*   日本語
*   한국어